from utils.generators import generate_valid_phone_number, generate_birthday_exact_age, \
    generate_birthday_age_yesterday, generate_birthday_age_tomorrow


request_body_with_non_required = {
    "phone_number": generate_valid_phone_number(),
    "firstname": "Денис",
    "lastname": "Куманцов",
    "patronymic": "Игоревич",
    "birthday": "1999-09-03",
    "passport_serial": 1234,
    "passport_number": 567890,
    "password": "Qwerty!123"
}

request_body_without_non_required = {
    "phone_number": generate_valid_phone_number(),
    "firstname": "Денис",
    "lastname": "Куманцов",
    "patronymic": "",
    "birthday": "1999-09-03",
    "passport_serial": 1234,
    "passport_number": 567890,
    "password": "Qwerty!123"
}


negative_phone_number_test_data = [
    # Длина числа
    999999999,
    10000000000,
    -1,
    0,
    10**20,

    # Строки
    "8005553535",
    "123",
    "1234567890123",
    "80055535аб",
    "80055535!-",
    "80055535@&",

    # Пробелы, табуляция, перенос строки
    " ",
    " 8005553535",
    "8005553535 ",
    "800 5553535",
    "\t8005553535",
    "\n8005553535",

    # Пустая/None
    "",
    None,

    # Булевы значения
    True,
    False,

    # Списки и словари
    [],
    {},

    # Float
    3.14,
]


positive_firstname_test_data = [
    "а" * 2,
    "а" * 3,
    "а" * 25,
    "а" * 254,
    "а" * 255,
    "Лика-Лика",
    "Лика Лика",
]


negative_firstname_test_data = [
    # Длина
    "а" * 1,
    "а" * 256,
    "а" * 777,

    # Пустая/None
    "",
    None,

    # Типы
    123,
    3.14,
    True,
    False,
    ["Лика"],
    {"Лика": "Денис"},

    # Латиница, цифры, спецсимволы
    "Лика123",
    "Лика!",
    "Лика&",
    "Denis",
    "Denis123",
    "Denis!",
    "Denis&",

    # Пробелы и табуляции
    " ",
    " Лика",
    "Лика ",
    "\tЛика",
    "Лика\t",
    "Ли\tка",
    "\nЛика",
    "Лика\n",
    "Ли\nка",
]


positive_lastname_test_data = [
    "а" * 2,
    "а" * 3,
    "а" * 25,
    "а" * 254,
    "а" * 255,
    "Петров-Сидоров",
    "Петров Сидоров",
]


negative_lastname_test_data = [
    # Длина
    "а" * 1,
    "а" * 256,
    "а" * 777,

    # Пустая/None
    "",
    None,

    # Типы
    123,
    3.14,
    True,
    False,
    [],
    {},

    # Латиница, цифры, спецсимволы
    "Петров123",
    "Петров!",
    "Петров&",
    "Petrov",
    "Petrov123",
    "Petrov!",
    "Petrov&",

    # Пробелы и табуляции
    " ",
    " Петров",
    "Петров ",
    "\tПетров",
    "Петров\t",
    "Пет\tров",
    "\nПетров",
    "Петров\n",
    "Пет\nров",
]


positive_patronymic_test_data = [
    "а" * 2,
    "а" * 3,
    "а" * 25,
    "а" * 254,
    "а" * 255,
    "",
]


negative_patronymic_test_data = [
    # Длина
    "а" * 1,
    "а" * 256,
    "а" * 777,

    # None
    None,

    # Типы
    123,
    3.14,
    True,
    False,
    [],
    {},

    # Латиница, цифры, спецсимволы
    "Игоревич123",
    "Игоревич!",
    "Игоревич&",
    "Igor",
    "Igor123",
    "Igor!",
    "Igor&",

    # Пробелы и табуляции
    " ",
    " Игоревич",
    "Иг ор",
    "Игор ",
    "\tИгоревич",
    "Игоревич\t",
    "И\tгор",
    "\nИгоревич",
    "Игоревич\n",
    "И\nгор",
]


positive_birthday_test_data = [
    generate_birthday_age_yesterday(16),   # исполнилось 16 вчера
    generate_birthday_exact_age(16),       # ровно 16 сегодня
    generate_birthday_exact_age(17),       # 17 лет
    "1970-01-01",
    "2008-02-29",               # високосный год, ровно 17 лет
    "2009-02-28",               # 16 лет, 28 февраля
    "2008-04-30",               # 30 апреля
    "2008-03-31",               # 31 марта
]


negative_birthday_test_data = [
    # Пустые/None
    None,
    "",

    generate_birthday_age_tomorrow(16),    # завтра 16
    generate_birthday_exact_age(100),      # 100 лет

    "1999-09-03!",
    "1999-09-0!",
    "1999-09-03&",
    "1999-09-03ааа",
    "1999-0ааа",
    "1999.09.03",
    "1999/09/03",
    "1999&09&03",
    "0000-00-00",
    "2020-00-12",
    "2021-12-00",
    "0000-01-12",
    "9999-99-99",
    "9999-12-01",
    "2000-99-01",
    "2000-12-99",
    "2000-02-31",
    "2000-12-32",
    "2099-12-12",

    "2009-02-29",  # невисокосный год, 28 дней в месяце
    "2008-04-31",  # 31 апреля, в этом году 30 дней в апреле.

    " ",
    " 1999-09-03",
    "1999-09-03 ",
    "1999- 09-03",
    "\t1999-09-03",
    "1999-09-03\t",
    "1999-\t09-03",
    "\n1999-09-03",
    "1999-09-03\n",
    "1999-\n09-03",

    # Тип данных
    123,
    3.14,
    True,
    False,
    [],
    {},
]


positive_passport_serial_test_data = [
    "0000",
    "1234",
    "9999",
    "0001",
    "9998",
]


negative_passport_serial_test_data = [
    # Длина
    "1",
    "12",
    "123",
    "12345",
    "10000",
    "1" * 100,

    # None/пустая
    "",
    None,

    # Типы
    1234,
    3.14,
    True,
    False,
    [],
    {},

    # Буквы, спецсимволы
    "123б",
    "abcd",
    "123!",
    "123&",

    # Пробелы и табуляции
    " ",
    " 123",
    "123 ",
    "12 3",
    "\t1234",
    "1234\t",
    "12\t34",
    "\n1234",
    "1234\n",
    "12\n34",
]


positive_passport_number_test_data = [
    "000000",
    "123456",
    "999999",
    "000001",
    "999998",
]


negative_passport_number_test_data = [
    # Длина
    "1",
    "12",
    "123",
    "1234",
    "12345",
    "1234567",
    "1000000",
    "1" * 100,

    # None/пустая
    "",
    None,

    # Типы
    123456,
    3.14567,
    True,
    False,
    [],
    {},

    # Буквы, спецсимволы
    "12345б",
    "12345!",
    "12345&",
    "1234ab",
    "12$456",

    # Пробелы и табуляции
    " ",
    " 12345",
    "12345 ",
    "12 345",
    "\t123456",
    "123456\t",
    "12\t3456",
    "\n123456",
    "123456\n",
    "12\n3456",
]


positive_password_test_data = [
    "Password1!@",
    "A1b2C#3d4&",
    "Pass1@word.com",
    "PASSWORD1!",
    " A1b2c3d4&",
    "A1b2c3d4& ",
    "A1b2 c3d4&",
]

negative_password_test_data = [
    # Длина
    "P1!",
    "Pass1$",
    "Abc1&",
    "A1b2c3$",

    # Ограничения по длине
    "A1&" + "a" * 254,
    "A1&" + "a" * 255,
    "A1&" + "a" * 256,
    "A1&" + "a" * 777,

    # Состав
    "Password1",
    "Password",
    "password1&",
    "Пароль1!&",

    # None/пустая
    "",
    None,

    # Типы
    123456789,
    3.14159265,
    True,
    False,
    [],
    {},

    # Пробелы и табуляции
    " ",
    "\tA1b2c3d4&",
    "A1b2c3d4&\t",
    "A1b2c\t3d4&",
    "\nA1b2c3d4&",
    "A1b2c3d4&\n",
    "A1b2\nc3d4&",
    "\rA1b2c3d4&",
    "A1b2c3d4&\r",
    "\vA1b2c3d4&",
    "A1b2c3d4&\v",

    # Юникод
    "P汉字sword1&!",
    "Password1&!😊",
    "Pässword1&!",
]