from utils.generators import generate_valid_phone_number


request_body_with_non_required = {
        "phone_number": generate_valid_phone_number(),
        "firstname": "Денис",
        "lastname": "Куманцов",
        "patronymic": "Игоревич",
        "birthday": "1999-09-03",
        "passport_serial": 1234,
        "passport_number": 567890,
        "password": "Qwerty!123"
}

request_body_without_non_required = {
        "phone_number": generate_valid_phone_number(),
        "firstname": "Денис",
        "lastname": "Куманцов",
        "patronymic": "",
        "birthday": "1999-09-03",
        "passport_serial": 1234,
        "passport_number": 567890,
        "password": "Qwerty!123"
}

invalid_phone_numbers = [
    # Длина числа
    800000000,
    80000000000,

    # Строки
    "8005553535",
    "123",
    "1234567890123",
    "80055535аб",
    "80055535!-",
    "80055535@&",

    # Пробелы, табуляция, перенос в строке
    " 8005553535",
    "8005553535 ",
    "800 5553535",
    "\t8005553535",
    "\n8005553535",

    # Пустые значения
    "",
    None,

    # Булевые значения
    True,
    False,

    # Списки и словари
    [],
    [8005553535],
    {},
    {"number": 8005553535},

    # Float
    3.1415
]

invalid_firstnames = [
    # Длина строки
    ("а" * 1, 422),
    ("а" * 2, 200),
    ("а" * 3, 200),
    ("а" * 25, 200),
    ("а" * 254, 200),
    ("а" * 255, 200),
    ("а" * 256, 422),

    # Пустая / None
    ("", 422),
    (None, 422),

    # Тип данных
    (123, 422),
    (3.14, 422),
    (True, 422),
    (False, 422),
    ([], 422),
    ({}, 422),

    # Нарушение правил (латиница, цифры, символы)
    ("Лика123", 422),    # кириллица + цифры
    ("Лика!", 422),      # кириллица + спецсимвол
    ("Лика&", 422),      # кириллица + спецсимвол
    ("Denis", 422),      # латиница
    ("Denis123", 422),   # латиница + цифры
    ("Denis!", 422),     # латиница + спецсимвол
    ("Denis&", 422),     # латиница + спецсимвол

    # Пробелы
    (" Лика", 422),      # пробел в начале
    ("Ли ка", 422),      # пробел в середине
    ("Лика ", 422),      # пробел в конце
]